from llm import *

class QuestGen:
    def __init__(self, data):
        self.data = data

    def gen4_questions(self):
        llm = LLM('yandex')
        prompt = f"""
Ты специалист приёмной комиссии КФУ. Предварительно абитурент выбрад некоторый спектр образовательных программ, составь 4 вопроса, чтобы определить, какая из этих образовательных программа подойдёт студенту по выбранному направлению в Казанском Федеральном университете.
Ты получишь на вход информацию о абитуренте - его ответы на вопросы о личности. Также ты получишь на вход примерный спектр образовательных программ, которые могут подойти абитуренту. Ты должен задать ИМЕННО ТАКИЕ ВОПРОСЫ, чтобы определить какая из приведённых программ подойдёт студенту!! Т.е вопросы по содержанию программ. Ты можешь включать в один вопрос сразу несколько, если это необходимо
Вопросы выдать в СТРОГО форматированном виде - разделить все вопросы символом |
Входные данные:
{self.data}
"""
        quests = llm.generate_response(prompt)
        return quests
        

    def gen_no_question(self):
        llm = LLM('yandex')
        prompt = f"""
Сгенерируй 5 вопросов, чтобы определить, какая образовательная программа подойдёт студенту в Казанском Федеральном Университете. Проблема в том, что студент не знает, что ему интересно, поэтому на основе информации о нём составь вопросы, о том, что может быть интересно студенту, но не справшивай напрямую. Важно ещё уложиться в 3 вопроса!
{self.data}
"""
        quests = llm.generate_response(prompt)
        return quests
